MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX120F032C.PIC
      <edc:SFRDef edc:_addr="0x1F8832B0" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="4" edc:access="--------nnnnnnnnnnnnnnnnssnnn---" edc:cname="DCH3ECON" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------111111111111111100000---" edc:name="DCH3ECON" edc:nzwidth="0x20" edc:por="--------111111111111111100000---" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AIRQEN" edc:desc="" edc:mask="0x1" edc:name="AIRQEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIRQEN" edc:desc="" edc:mask="0x1" edc:name="SIRQEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PATEN" edc:desc="" edc:mask="0x1" edc:name="PATEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CABORT" edc:desc="" edc:mask="0x1" edc:name="CABORT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFORCE" edc:desc="" edc:mask="0x1" edc:name="CFORCE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHSIRQ" edc:desc="" edc:mask="0xff" edc:name="CHSIRQ" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="CHAIRQ" edc:desc="" edc:mask="0xff" edc:name="CHAIRQ" edc:nzwidth="0x8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8832C0" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="4" edc:access="--------nnnnnnnn--------nnnnnnnn" edc:cname="DCH3INT" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000--------00000000" edc:name="DCH3INT" edc:nzwidth="0x20" edc:por="--------00000000--------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHERIF" edc:desc="" edc:mask="0x1" edc:name="CHERIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHTAIF" edc:desc="" edc:mask="0x1" edc:name="CHTAIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHCCIF" edc:desc="" edc:mask="0x1" edc:name="CHCCIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBCIF" edc:desc="" edc:mask="0x1" edc:name="CHBCIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHDHIF" edc:desc="" edc:mask="0x1" edc:name="CHDHIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHDDIF" edc:desc="" edc:mask="0x1" edc:name="CHDDIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHSHIF" edc:desc="" edc:mask="0x1" edc:name="CHSHIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHSDIF" edc:desc="" edc:mask="0x1" edc:name="CHSDIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="CHERIE" edc:desc="" edc:mask="0x1" edc:name="CHERIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHTAIE" edc:desc="" edc:mask="0x1" edc:name="CHTAIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHCCIE" edc:desc="" edc:mask="0x1" edc:name="CHCCIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBCIE" edc:desc="" edc:mask="0x1" edc:name="CHBCIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHDHIE" edc:desc="" edc:mask="0x1" edc:name="CHDHIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHDDIE" edc:desc="" edc:mask="0x1" edc:name="CHDDIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHSHIE" edc:desc="" edc:mask="0x1" edc:name="CHSHIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHSDIE" edc:desc="" edc:mask="0x1" edc:name="CHSDIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8832D0" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DCH3SSA" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="DCH3SSA" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCH3SSA" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="DCH3SSA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="CHSSA" edc:mask="0xffffffff" edc:name="CHSSA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8832E0" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DCH3DSA" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="DCH3DSA" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCH3DSA" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="DCH3DSA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="CHDSA" edc:mask="0xffffffff" edc:name="CHDSA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8832F0" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="DCH3SSIZ" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="DCH3SSIZ" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHSSIZ" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CHSSIZ" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F883300" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="DCH3DSIZ" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="DCH3DSIZ" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHDSIZ" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CHDSIZ" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F883310" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="DCH3SPTR" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="DCH3SPTR" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHSPTR" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CHSPTR" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F883320" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="4" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="DCH3DPTR" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="DCH3DPTR" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHDPTR" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CHDPTR" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F883330" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="DCH3CSIZ" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="DCH3CSIZ" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHCSIZ" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CHCSIZ" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F883340" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="DCH3CPTR" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="DCH3CPTR" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHCPTR" edc:desc="" edc:islanghidden="true" edc:mask="0xFFFF" edc:name="CHCPTR" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F883350" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="4" edc:access="------------------------nnnnnnnn" edc:cname="DCH3DAT" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------xxxxxxxx" edc:name="DCH3DAT" edc:nzwidth="0x20" edc:por="------------------------xxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCHPDAT" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="DCHPDAT" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F883360" edc:offset="7392"/>
      <edc:SFRDef edc:_addr="0x1F885040" edc:_begin="0x40" edc:_end="0x90" edc:_modsrc="DOS-01195_usb_otgcore_pb_v2.Module" edc:_refcount="1" edc:access="------------------------nnnnnn-n" edc:cname="U1OTGIR" edc:desc="" edc:grp="USB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------000000-0" edc:name="U1OTGIR" edc:nzwidth="0x20" edc:por="------------------------000000-0" edc:portals="CLR - -" ltx:baseofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VBUSVDIF" edc:desc="" edc:mask="0x1" edc:name="VBUSVDIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SESENDIF" edc:desc="" edc:mask="0x1" edc:name="SESENDIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SESVDIF" edc:desc="" edc:mask="0x1" edc:name="SESVDIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACTVIF" edc:desc="" edc:mask="0x1" edc:name="ACTVIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LSTATEIF" edc:desc="" edc:mask="0x1" edc:name="LSTATEIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T1MSECIF" edc:desc="" edc:mask="0x1" edc:name="T1MSECIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDIF" edc:desc="" edc:mask="0x1" edc:name="IDIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F885050" edc:_begin="0x40" edc:_end="0x90" edc:_modsrc="DOS-01195_usb_otgcore_pb_v2.Module" edc:_refcount="1" edc:access="------------------------nnnnnn-n" edc:cname="U1OTGIE" edc:desc="" edc:grp="USB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------000000-0" edc:name="U1OTGIE" edc:nzwidth="0x20" edc:por="------------------------000000-0" edc:portals="CLR SET INV" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VBUSVDIE" edc:desc="" edc:mask="0x1" edc:name="VBUSVDIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SESENDIE" edc:desc="" edc:mask="0x1" edc:name="SESENDIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SESVDIE" edc:desc="" edc:mask="0x1" edc:name="SESVDIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACTVIE" edc:desc="" edc:mask="0x1" edc:name="ACTVIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LSTATEIE" edc:desc="" edc:mask="0x1" edc:name="LSTATEIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T1MSECIE" edc:desc="" edc:mask="0x1" edc:name="T1MSECIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDIE" edc:desc="" edc:mask="0x1" edc:name="IDIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F885060" edc:_begin="0x40" edc:_end="0x90" edc:_modsrc="DOS-01195_usb_otgcore_pb_v2.Module" edc:_refcount="1" edc:access="------------------------n-n-nn-n" edc:cname="U1OTGSTAT" edc:desc="" edc:grp="USB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------0-0-00-0" edc:name="U1OTGSTAT" edc:nzwidth="0x20" edc:por="------------------------0-0-00-0" edc:portals="- - -" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VBUSVD" edc:desc="" edc:mask="0x1" edc:name="VBUSVD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SESEND" edc:desc="" edc:mask="0x1" edc:name="SESEND" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SESVD" edc:desc="" edc:mask="0x1" edc:name="SESVD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LSTATE" edc:desc="" edc:mask="0x1" edc:name="LSTATE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ID" edc:desc="" edc:mask="0x1" edc:name="ID" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F885070" edc:_begin="0x40" edc:_end="0x90" edc:_modsrc="DOS-01195_usb_otgcore_pb_v2.Module" edc:_refcount="1" edc:access="------------------------nnnnnnnn" edc:cname="U1OTGCON" edc:desc="" edc:grp="USB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="U1OTGCON" edc:nzwidth="0x20" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VBUSDIS" edc:desc="" edc:mask="0x1" edc:name="VBUSDIS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VBUSCHG" edc:desc="" edc:mask="0x1" edc:name="VBUSCHG" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OTGEN" edc:desc="" edc:mask="0x1" edc:name="OTGEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VBUSON" edc:desc="" edc:mask="0x1" edc:name="VBUSON" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMPULDWN" edc:desc="" edc:mask="0x1" edc:name="DMPULDWN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPPULDWN" edc:desc="" edc:mask="0x1" edc:name="DPPULDWN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMPULUP" edc:desc="" edc:mask="0x1" edc:name="DMPULUP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPPULUP" edc:desc="" edc:mask="0x1" edc:name="DPPULUP" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F885080" edc:_begin="0x40" edc:_end="0x90" edc:_modsrc="DOS-01195_usb_otgcore_pb_v2.Module" edc:_refcount="1" edc:access="------------------------r--nn-nn" edc:cname="U1PWRC" edc:desc="" edc:grp="USB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------0--0x-00" edc:name="U1PWRC" edc:nzwidth="0x20" edc:por="------------------------0--0x-00" edc:portals="CLR SET INV" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="USBPWR" edc:desc="" edc:mask="0x1" edc:name="USBPWR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USUSPEND" edc:desc="" edc:mask="0x1" edc:name="USUSPEND" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="USBBUSY" edc:desc="" edc:mask="0x1" edc:name="USBBUSY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USLPGRD" edc:desc="" edc:mask="0x1" edc:name="USLPGRD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="UACTPND" edc:desc="" edc:mask="0x1" edc:name="UACTPND" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F885090" edc:offset="368"/>
      <edc:SFRDef edc:_addr="0x1F885200" edc:_begin="0x200" edc:_end="0x2f0" edc:_modsrc="DOS-01195_usb_otgcore_pb_v2.Module" edc:_refcount="2" edc:access="------------------------nnnnnnnn" edc:cname="U1IR" edc:desc="" edc:grp="USB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="U1IR" edc:nzwidth="0x20" edc:por="------------------------00000000" edc:portals="CLR - -" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="URSTIF_DETACHIF" edc:desc="" edc:mask="0x1" edc:name="URSTIF_DETACHIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UERRIF" edc:desc="" edc:mask="0x1" edc:name="UERRIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SOFIF" edc:desc="" edc:mask="0x1" edc:name="SOFIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRNIF" edc:desc="" edc:mask="0x1" edc:name="TRNIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDLEIF" edc:desc="" edc:mask="0x1" edc:name="IDLEIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESUMEIF" edc:desc="" edc:mask="0x1" edc:name="RESUMEIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ATTACHIF" edc:desc="" edc:mask="0x1" edc:name="ATTACHIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLIF" edc:desc="" edc:mask="0x1" edc:name="STALLIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="DETACHIF" edc:desc="" edc:mask="0x1" edc:name="DETACHIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="URSTIF" edc:desc="" edc:mask="0x1" edc:name="URSTIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F885210" edc:_begin="0x200" edc:_end="0x2f0" edc:_modsrc="DOS-01195_usb_otgcore_pb_v2.Module" edc:_refcount="2" edc:access="------------------------nnnnnnnn" edc:cname="U1IE" edc:desc="" edc:grp="USB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="U1IE" edc:nzwidth="0x20" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="URSTIE_DETACHIE" edc:desc="" edc:mask="0x1" edc:name="URSTIE_DETACHIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UERRIE" edc:desc="" edc:mask="0x1" edc:name="UERRIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SOFIE" edc:desc="" edc:mask="0x1" edc:name="SOFIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRNIE" edc:desc="" edc:mask="0x1" edc:name="TRNIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDLEIE" edc:desc="" edc:mask="0x1" edc:name="IDLEIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESUMEIE" edc:desc="" edc:mask="0x1" edc:name="RESUMEIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ATTACHIE" edc:desc="" edc:mask="0x1" edc:name="ATTACHIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLIE" edc:desc="" edc:mask="0x1" edc:name="STALLIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="DETACHIE" edc:desc="" edc:mask="0x1" edc:name="DETACHIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="URSTIE" edc:desc="" edc:mask="0x1" edc:name="URSTIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
