MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX120F032C.PIC
      <edc:SFRDef edc:_addr="0x1F886150" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="2" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNPUB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="CNPUB" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUB0" edc:desc="" edc:mask="0x1" edc:name="CNPUB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB1" edc:desc="" edc:mask="0x1" edc:name="CNPUB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB2" edc:desc="" edc:mask="0x1" edc:name="CNPUB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB3" edc:desc="" edc:mask="0x1" edc:name="CNPUB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB4" edc:desc="" edc:mask="0x1" edc:name="CNPUB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB5" edc:desc="" edc:mask="0x1" edc:name="CNPUB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB6" edc:desc="" edc:mask="0x1" edc:name="CNPUB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB7" edc:desc="" edc:mask="0x1" edc:name="CNPUB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB8" edc:desc="" edc:mask="0x1" edc:name="CNPUB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB9" edc:desc="" edc:mask="0x1" edc:name="CNPUB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB10" edc:desc="" edc:mask="0x1" edc:name="CNPUB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB11" edc:desc="" edc:mask="0x1" edc:name="CNPUB11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB12" edc:desc="" edc:mask="0x1" edc:name="CNPUB12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB13" edc:desc="" edc:mask="0x1" edc:name="CNPUB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB14" edc:desc="" edc:mask="0x1" edc:name="CNPUB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB15" edc:desc="" edc:mask="0x1" edc:name="CNPUB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886160" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="2" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNPDB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="CNPDB" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDB0" edc:desc="" edc:mask="0x1" edc:name="CNPDB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB1" edc:desc="" edc:mask="0x1" edc:name="CNPDB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB2" edc:desc="" edc:mask="0x1" edc:name="CNPDB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB3" edc:desc="" edc:mask="0x1" edc:name="CNPDB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB4" edc:desc="" edc:mask="0x1" edc:name="CNPDB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB5" edc:desc="" edc:mask="0x1" edc:name="CNPDB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB6" edc:desc="" edc:mask="0x1" edc:name="CNPDB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB7" edc:desc="" edc:mask="0x1" edc:name="CNPDB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB8" edc:desc="" edc:mask="0x1" edc:name="CNPDB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB9" edc:desc="" edc:mask="0x1" edc:name="CNPDB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB10" edc:desc="" edc:mask="0x1" edc:name="CNPDB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB11" edc:desc="" edc:mask="0x1" edc:name="CNPDB11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB12" edc:desc="" edc:mask="0x1" edc:name="CNPDB12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB13" edc:desc="" edc:mask="0x1" edc:name="CNPDB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB14" edc:desc="" edc:mask="0x1" edc:name="CNPDB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB15" edc:desc="" edc:mask="0x1" edc:name="CNPDB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886170" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="2" edc:access="----------------n-n-------------" edc:cname="CNCONB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CNCONB" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="13"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886180" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="2" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNENB" edc:desc="" edc:grp="PORTB" edc:impl="0xffc0ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000------xxxxxxxxxxxxxxxx" edc:name="CNENB" edc:nzwidth="0x20" edc:por="0000000000------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEB0" edc:desc="" edc:mask="0x1" edc:name="CNIEB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB1" edc:desc="" edc:mask="0x1" edc:name="CNIEB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB2" edc:desc="" edc:mask="0x1" edc:name="CNIEB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB3" edc:desc="" edc:mask="0x1" edc:name="CNIEB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB4" edc:desc="" edc:mask="0x1" edc:name="CNIEB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB5" edc:desc="" edc:mask="0x1" edc:name="CNIEB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB6" edc:desc="" edc:mask="0x1" edc:name="CNIEB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB7" edc:desc="" edc:mask="0x1" edc:name="CNIEB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB8" edc:desc="" edc:mask="0x1" edc:name="CNIEB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB9" edc:desc="" edc:mask="0x1" edc:name="CNIEB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB10" edc:desc="" edc:mask="0x1" edc:name="CNIEB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB11" edc:desc="" edc:mask="0x1" edc:name="CNIEB11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB12" edc:desc="" edc:mask="0x1" edc:name="CNIEB12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB13" edc:desc="" edc:mask="0x1" edc:name="CNIEB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB14" edc:desc="" edc:mask="0x1" edc:name="CNIEB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB15" edc:desc="" edc:mask="0x1" edc:name="CNIEB15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886190" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="2" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNSTATB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="CNSTATB" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATB0" edc:desc="" edc:mask="0x1" edc:name="CNSTATB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB1" edc:desc="" edc:mask="0x1" edc:name="CNSTATB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB2" edc:desc="" edc:mask="0x1" edc:name="CNSTATB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB3" edc:desc="" edc:mask="0x1" edc:name="CNSTATB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB4" edc:desc="" edc:mask="0x1" edc:name="CNSTATB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB5" edc:desc="" edc:mask="0x1" edc:name="CNSTATB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB6" edc:desc="" edc:mask="0x1" edc:name="CNSTATB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB7" edc:desc="" edc:mask="0x1" edc:name="CNSTATB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB8" edc:desc="" edc:mask="0x1" edc:name="CNSTATB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB9" edc:desc="" edc:mask="0x1" edc:name="CNSTATB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB10" edc:desc="" edc:mask="0x1" edc:name="CNSTATB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB11" edc:desc="" edc:mask="0x1" edc:name="CNSTATB11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB12" edc:desc="" edc:mask="0x1" edc:name="CNSTATB12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB13" edc:desc="" edc:mask="0x1" edc:name="CNSTATB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB14" edc:desc="" edc:mask="0x1" edc:name="CNSTATB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB15" edc:desc="" edc:mask="0x1" edc:name="CNSTATB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8861A0" edc:offset="96"/>
      <edc:SFRDef edc:_addr="0x1F886200" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="3" edc:access="----------------------------n-nn" edc:cname="ANSELC" edc:desc="" edc:grp="PORTC" edc:impl="0xffff000b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1-11" edc:name="ANSELC" edc:nzwidth="0x20" edc:por="----------------------------1-11" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ANSC0" edc:desc="" edc:mask="0x1" edc:name="ANSC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSC1" edc:desc="" edc:mask="0x1" edc:name="ANSC1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSC3" edc:desc="" edc:mask="0x1" edc:name="ANSC3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886210" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="3" edc:access="----------------------n-----n-nn" edc:cname="TRISC" edc:desc="" edc:grp="PORTC" edc:impl="0xffff020b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------1-----1-11" edc:name="TRISC" edc:nzwidth="0x20" edc:por="----------------------1-----1-11" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISC0" edc:desc="" edc:mask="0x1" edc:name="TRISC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISC1" edc:desc="" edc:mask="0x1" edc:name="TRISC1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISC3" edc:desc="" edc:mask="0x1" edc:name="TRISC3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISC9" edc:desc="" edc:mask="0x1" edc:name="TRISC9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886220" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="3" edc:access="----------------------n-----n-nn" edc:cname="PORTC" edc:desc="" edc:grp="PORTC" edc:impl="0xffff020b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------x-----x-xx" edc:name="PORTC" edc:nzwidth="0x20" edc:por="----------------------x-----x-xx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RC0" edc:desc="" edc:mask="0x1" edc:name="RC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RC1" edc:desc="" edc:mask="0x1" edc:name="RC1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RC3" edc:desc="" edc:mask="0x1" edc:name="RC3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RC9" edc:desc="" edc:mask="0x1" edc:name="RC9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886230" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="3" edc:access="----------------------n-----n-nn" edc:cname="LATC" edc:desc="" edc:grp="PORTC" edc:impl="0xffff020b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------x-----x-xx" edc:name="LATC" edc:nzwidth="0x20" edc:por="----------------------x-----x-xx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATC0" edc:desc="" edc:mask="0x1" edc:name="LATC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC1" edc:desc="" edc:mask="0x1" edc:name="LATC1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATC3" edc:desc="" edc:mask="0x1" edc:name="LATC3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATC9" edc:desc="" edc:mask="0x1" edc:name="LATC9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886240" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="3" edc:access="----------------------n---------" edc:cname="ODCC" edc:desc="" edc:grp="PORTC" edc:impl="0xffff0200" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0---------" edc:name="ODCC" edc:nzwidth="0x20" edc:por="----------------------0---------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCC9" edc:desc="" edc:mask="0x1" edc:name="ODCC9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886250" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01423_TRAA_Ports.Module" edc:_refcount="3" edc:access="----------------------n-----n-nn" edc:cname="CNPUC" edc:desc="" edc:grp="PORTC" edc:impl="0xffff020b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------x-----x-xx" edc:name="CNPUC" edc:nzwidth="0x20" edc:por="----------------------x-----x-xx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUC0" edc:desc="" edc:mask="0x1" edc:name="CNPUC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC1" edc:desc="" edc:mask="0x1" edc:name="CNPUC1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUC3" edc:desc="" edc:mask="0x1" edc:name="CNPUC3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUC9" edc:desc="" edc:mask="0x1" edc:name="CNPUC9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
